# Rebar Update Curves Data Get Hook Orientation Angle Method

Source: https://www.revitapidocs.com/2026/50bd6278-bbb7-7b6c-029d-e34f7b42ddb9.htm

---

| Rebar Update Curves Data Get Hook Orientation Angle Method |
| --- |

**Note: This API is now obsolete.**

Get the termination's rotation angle at end that is currently in the rebar.
 The angle is used for both hook and crank.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
[ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use RebarUpdateCurvesData.GetTerminationRotationAngle instead.")]
public double GetHookOrientationAngle(
	int end
)
```

```
<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use RebarUpdateCurvesData.GetTerminationRotationAngle instead.")>
Public Function GetHookOrientationAngle (
	end As Integer
) As Double
```

```
public:
[ObsoleteAttribute(L"This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use RebarUpdateCurvesData.GetTerminationRotationAngle instead.")]
double GetHookOrientationAngle(
	int end
)
```

```
[<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use RebarUpdateCurvesData.GetTerminationRotationAngle instead.")>]
member GetHookOrientationAngle :
        end : int -> float
```

#### Parameters

end Int32
:   The end of bar. Should be 0 for start or 1 for end.

#### Return Value

Double
The rotation angle at end that is currently in the rebar. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | Invalid end. |

See Also

#### Reference

RebarUpdateCurvesData Class Autodesk.Revit.DB.Structure Namespace